## Terraform Plan Result


### environments/stg/app/alb
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

### environments/stg/app/asg
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_group.this will be updated in-place
  ~ resource "aws_autoscaling_group" "this" {
      ~ desired_capacity                 = 1 -> 2
        id                               = "stg-asg"
        name                             = "stg-asg"
        # (31 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

### environments/stg/app/ec2
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

### environments/stg/app/launch_template
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

### environments/stg/db
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.db.aws_db_instance.this must be replaced
-/+ resource "aws_db_instance" "this" {
      ~ address                               = "stg-mysql.cpk0wk0uaymd.ap-southeast-2.rds.amazonaws.com" -> (known after apply)
      ~ arn                                   = "arn:aws:rds:ap-southeast-2:676259472245:db:stg-mysql" -> (known after apply)
      ~ availability_zone                     = "ap-southeast-2b" -> (known after apply)
      ~ backup_retention_period               = 0 -> (known after apply)
      ~ backup_target                         = "region" -> (known after apply)
      ~ backup_window                         = "15:10-15:40" -> (known after apply)
      ~ ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> (known after apply)
      + character_set_name                    = (known after apply)
      - customer_owned_ip_enabled             = false -> null
      ~ database_insights_mode                = "standard" -> (known after apply)
      ~ db_name                               = "mysqlDB" -> "social_app" # forces replacement
      - deletion_protection                   = false -> null
      - domain_dns_ips                        = [] -> null
      + domain_fqdn                           = (known after apply)
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "stg-mysql.cpk0wk0uaymd.ap-southeast-2.rds.amazonaws.com:3306" -> (known after apply)
      ~ engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      ~ engine_version_actual                 = "8.0.42" -> (known after apply)
      ~ hosted_zone_id                        = "Z32T0VRHXEXS0V" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "db-L35GPUYR74SVB7LDULC4WTRMSA" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      ~ iops                                  = 0 -> (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      ~ license_model                         = "general-public-license" -> (known after apply)
      ~ listener_endpoint                     = [] -> (known after apply)
      ~ maintenance_window                    = "thu:14:29-thu:14:59" -> (known after apply)
      ~ master_user_secret                    = [] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      - max_allocated_storage                 = 0 -> null
      + monitoring_role_arn                   = (known after apply)
      ~ multi_az                              = false -> (known after apply)
      + nchar_character_set_name              = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ option_group_name                     = "default:mysql-8-0" -> (known after apply)
      ~ parameter_group_name                  = "default.mysql8.0" -> (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 3306 -> (known after apply)
      + replica_mode                          = (known after apply)
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "db-L35GPUYR74SVB7LDULC4WTRMSA" -> (known after apply)
      + snapshot_identifier                   = (known after apply)
      ~ status                                = "available" -> (known after apply)
      - storage_encrypted                     = false -> null
      ~ storage_throughput                    = 0 -> (known after apply)
      ~ storage_type                          = "gp2" -> (known after apply)
        tags                                  = {
            "Created_by"  = "Tong Viet Hoang"
            "Environment" = "Staging"
            "Project"     = "STP-2025"
        }
      + timezone                              = (known after apply)
        # (27 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ db_instance_endpoint = "stg-mysql.cpk0wk0uaymd.ap-southeast-2.rds.amazonaws.com:3306" -> (known after apply)
  ~ db_instance_id       = "db-L35GPUYR74SVB7LDULC4WTRMSA" -> (known after apply)
```
<!-- Sticky Pull Request Commentterraform-plan -->